[
  {
    "title": "What Was The Original American Populism?",
    "author": "albino squirrel",
    "date": "2022/11/22",
    "thumbnail": "/media/thumbnails/americanpopulism.jpg",
    "content": "<p>We often time see debates on who in American politics is the real populist some say Donald Trump and the conservatives’ others will say Bernie Sanders and his social democrats and there will also be those who say Marxism or Fascism are the true and real forms of populism. However, if we look at the original American populists of the 1870s to 1890s that being the People Populist Party, The Farmer Alliance, the Knights of Labor, National Labor Union, and the Greenback party we find there are many similarities with all tendencies but had many stark differences.</p><br><p>What united the People Populist Party all the way to the Greenback party was a strong resistance to monopoly capitalism, Banking cartels and support for cooperatives and preservation of family farms, craftmanship, artisans, shopkeepers, and local communities that where being displaced by the centralization of land and capital by corporations and banking cartels. They were also very localist, religious, had negative attitudes towards immigration and were agrarian in many cases. They were also very key on producers and workers owning the means of production not being controlled by large corporate or government bureaucracies which is the heart of original American Populism.</p><br><p>Like mentioned earlier the original American populism has some similarities with current forms of so-called populism but have many strong differences. For starters if we are to look at the Trump forms of populism, we see it shares its conservative and anti-immigration stances however Trump populism was hardly against corporate capitalism despite many elements of this class despising him. Not to mention Trumpian populism fails to see how corporate capitalism wants cheap foreign labor and how corporate monopolies destroyed small business and traditional social norms that original populist sought to preserve. Sanders shares the some of the anti-capitalist sentiments however if we get down to what social democracy is which is a welfare state which hardly opposes corporate bureaucracy which in many ways strengths it and removes support for more radical opposition to capitalism not to mention its strengths government bureaucracy as well.  Fascism shares its synthesis politics and support for unions however what separates American populism is the localist and anti-centralization sentiments of the populist while fascism is inherently statist. Not to mention the reason the original populist wanted to preserve localism and mass proprietorship/ ownership by forming cooperatives was not only to preserve their way of life and independence but also because mass proprietorship was seen as something necessary for democracy to survive and not have politicians be controlled by large corporate or banking interest while fascism is an inherently anti-democratic movement. Marxism shares many of populism anti-capitalist sentiments however Marxism believed that the small shopkeepers, farms, and others who made up populist were destined to be defeated by larger corporate industrial capitalism and centralize industrial production, the last one even being also a part of a Marxian socialist society both in theory and in practice seeing it as the progress of history. Populist were in complete revolt against this so-called progress of the centralization of productions which they fought against in name of keeping control of the means of production or in case of National Labor Union and Knights of Labor to regain control and to preserve their local communities and democracy.</p><br><p>I believe that it becomes obvious after looking into how the original American populist opposed corporate and government bureaucracy it becomes clear that both the Trump, and Sanders forms of populism are nothing more than shams that are used to rally up people to support one section of ruling class over another instead of abolishing both. While Fascism and Marxism maybe strong opponents of the modern system but would still lead to centralization of power that so many want to move away from. However, I do admit that some industries like media, social media, large scale industries that must be that way have to be under state super vision but can still have some form of worker control weather be through a guild or union like system. I also admit that the agrarian democracy that the original populist wanted to preserve is long gone and there no way of going back too it. However, the populist strong distaste of capitalism, bureaucracy, and their belief in mass proprietorship and synthesis politics is worthy of keeping. The populist also attempts to unite different economic disciplines and races is also noble and needed if a populist movement is to succeed and maintain a populist American society.</p><br><p>With the rise of populism in the last several years and the recent railroad workers union deal which despite its reformism shows that unions and workers still have some power by organizing, it is necessary for real populist and dissidents to make their ideas known and to disprove and comfort those of both democrats and republicans who espouses this pseudo populism. Along with those who espouse welfare reform instead of the producers and workers owning the means of production. If any populist movement is to succeed it cannot just appeal to one group or industry but rather must be far reaching appealing to small businesses, the working class, rural people, churches, students, people from the right and left and of all racial demographics. United against international capitalism and for national liberation of this country from this class. While this is a long stretch it is not impossible take for example the March 8th Alliance in Lebanon which is made up of Muslim, Christian, secular parties and parties from both the right, left and in between who only a few decades ago were fighting a religious/class/ethnic sectarian civil war inside the country many times fighting with and against one another. If they can put aside their differences after trying to kill one another I’m pretty sure we can too.</p>",
    "references": [
      {
        "title": "The True and Only Heaven Progress and Its Critics by Christopher Lasch",
        "link": "#"
      },
      {
        "title": "Conservatism Against Itself by Christopher Lasch",
        "link": "#"
      },
      {
        "title": "The Communist Manifesto by Karl Marx Fredrick Engels",
        "link": "#"
      },
      {
        "title": "The Doctrine of Fascism by Benito Mussolini and Giovanni Gentile",
        "link": "#"
      },
      {
        "title": "March 8 Alliance – Wikipedia",
        "link": "https://en.wikipedia.org/wiki/March_8_Alliance#:~:text=The%20March%208%20Alliance%20%28%20Arabic%3A%20%D8%AA%D8%AD%D8%A7%D9%84%D9%81%208,and%20their%20opposition%20to%20the%20March%2014%20Alliance."
      },
      {
        "title": "A Railroad Strike Has Been Averted for Now. What Happens Next. | Barron’s ",
        "link": "https://www.barrons.com/articles/railroad-strike-deal-what-happens-next-51663367552"
      }
    ]
  },
  {
    "title": "The American Protectionist Economy of The Past and The Protectionist Economy of The Future",
    "date": "2022/11/22",
    "author": "albino squirrel",
    "thumbnail": "/media/thumbnails/americanprotectionism.jpg",
    "content": "For almost the last 80 years the United States has had a free trade and global economy. Meaning countries do trade with very little restrictions on their economies such as no tariffs and government subsides.  This has led to globalization, outsourcing of American jobs, dependence on foreign countries, less regulations and unions, suppression of wages, the destruction of smaller producer everywhere, mass immigration of both legal and illegal migration to America and brain drains in developing countries. In other words, free trade has had serve negative effects on the working class and has led to corporations to globally expanded meaning they have more power over economies, governments, and the average person.\nDespite the myth of America always being a free trade or even free market economy. The American economy was not always a free trade economy but rather was a protectionist economy that protected local industries and jobs throughout most of its existence. In fact, part of the reason why the American revolution was fought was because America did not want to rely on Britain for manufacturing and not be allowed to industrialize. In this article I will go over a brief history of protectionism in America, why it was adopted then abandon, and how we may return to a protectionist economy and how to avoid from making same mistakes.\nHistory of Protectionism\nAs mentioned earlier the American Revolution was not just fought over unfair taxation but Britain also had enacted laws to prevent America from industrializing such as a ban on high value manufacturing in hopes to keep America an agrarian colony that produced raw materials for British industrialist to then sell those products to America. Basically, to keep America dependent on British industries. Many of the founding father such as George Washington believed the only way to be truly independent was also to be economically independent. The second law to be passed under Washington presidency was the Tariff Act of 1789 which put a 5 percent tariff or tax on all imported goods in hopes of encouraging the consumer to buy domestic goods.\nWhile Washington enacted the first protectionist laws the real architecture of American Protectionism was none other than the first Secretary of the Treasury Alexander Hamilton a Founding Father and leader of the Federalist Party. Hamilton like Washington believed the only way for America to be truly independent was by having a protectionist economy that promoted industries at home. Along with having a manufactured based economy was the only way for America to compete with rival powers. Hamilton was not just a supporter for tariffs but even outright bans on imported goods and bans on export of raw materials that could be used for American manufactures. Hamilton also supported government subsidies for industries, key innovations, exporters, and inventions at home. These ideas would be favored by many American manufacturers and by Hamilton’s very own conservative Federalist Party which many founding fathers were members like John Adams (second president of America), John Jay, Rufus King, and John Marshall.\nThe federalist party largely represent the interest of the rising American industrial capitalist class that was largely located in the American North. However not all the founding fathers wanted tariffs or wanted a society dominated by manufactures rather wanted to keep America an agrarian economy. These interests were represented by the Democratic Republicans led by Thomas Jefferson, James Madison, and James Monroe which represented the slave plantation owners and other large farmers that were largely in the American South. The reason why plantation owners were against the tariffs was because they were producers of raw materials like cotton, and food that they sold to foreign countries like Great Britain. The tariff would raise the cost of living in the south and cut into the profits of the plantation owners due tariff on Britain.\nWhile the Federalist would only have one of their party members John Adams elected as president and would lose out to Jefferson Democratic Republicans. The Democratic Republican president James Madison (with Jefferson support)  would have to raise tariffs by 25 percent due to the war of 1812 that disrupted trade,  along with the government need for more revenue to fund the war and anti-British sentiments.    By 1816 the tariff had been raisin to 35 percent then to 40 percent by 1820. While support for tariffs remained high at this time the agrarian plantation class would oppose it again later in the late 1820s for many similar reasons as originally and seeing it as largely benefited the industrial capitalist who were growing rapidly at this time. Swallowing up the small family farmers and small manufactures which gave rise to big cities and monopolies in the North with industrialist having strong influence in the northern governments, that went against agrarian interest. While at the same time the protectionist economy did protected/ created American jobs, national security, independence and created new technologies and inventions at home just like Hamilton wanted.\nThe conflict between the industrialist protectionist North and slave plantation free traders South would continue all the way up to civil war. With the South prior to the war have some successes in overturning protectionist policies in their favor with the North conceding on some of the issues. However, this did not ease tensions and in 1861 Civil War broke out between the industrial North and the Agrarian South partially over the issue of Free Trade. Abraham Lincoln the president of America at the time was a strong protectionist. In fact, protectionism was his number 2 issue after anti-slavery. The South led by Jefferson Davis made free trade there second major issue after pro slavery with free trade being mandated in the Confederacy constitution. As everyone knows the Industrial North ended up winning the civil war in 1865 and Lincoln not only ended slavery but left a strong protectionist legacy amongst presidents all the way up to 1945.  \nHowever, as a consequence of the abolition of slave plantation owner class allowed for industrial Capitalism in the North to expand to the American South. Quickly taking a part many of the small farms in the region in the last few decades of the 19th century. Centralizing wealth and power into fewer hands with the wealthy becoming more detached from the average person and their interest. This is seen by the poor working standards, low wages, price gouging, import of cheap foreign labor, bloody suppression of worker strikes, with holding of bank loans to small producers and widespread fake products. Not to mention major monopoly such as the Rockefellers that controlled entire industries such as oil. While some of this was minimized due to reforms and trust busts that started widely under Theodore Roosevelt in the early 1900s and did have some support from some major capitalist such as J.P Morgan. However, many of the large-scale corporation would remain and did not entirely stop the divide between the supper rich and everyone else. \nAs the 20th century began the protectionist and isolationist policies of the US began to break down. With the United States playing a bigger role in world affairs and with a capitalist class who wanted to expand their markets pass Americas borders in their pursuit of more profit. This can be seen by the presidency of Woodrow Wilson and his ideas such as Wilsonianism a form of liberal internationalism that became popular in elite intellectual and capitalist circles after the first world war and would later morph into modern Neo Conservatism and Neo Liberalism. It can also be seen in the rise of international corporation from within America such as United Fruit Company that dominated many parts of Latin America such as Colombia or Guatemala. Another example the  Ford Motor company which did business in the anti-capitalist Soviet Union being partially responsible for modernizing the country and helping to make a rival for the American Capitalist order (which Ford Motor is a part of) and later for that Soviet Union to use the poor conditions in Latin America created by United Fruit company and other corporations to foster communist revolutions all throughout the continent that could of lead to the American capitalist own downfall, born out of their own greed. However, we are jumping ahead of ourselves as American government was still supporting protectionist policies and went back to isolation after Wilson left office.  And in 1922 tariffs were raised again to 50 percent with the Fordney-McCumber Tariff Act.  Another tariff was passed in 1930 called the Smoot-Hawley Tariff Act of 1930 raised tariff up to 60 percent. Being the last major American tariff of the 20th century.\nWhen America entered World War 2 after the attack on Pearl Harbor in December of 1941. America became involved with world affairs again and this time did not go back into isolation or protectionism. With the economies of Europe and East Asia being destroyed due to the war, made America into a world power. Which gave the American capitalist class a reason to expand into new markets in western Europe and parts of east Asia to not only to make more profit but also to counter act the Soviet Union which was also a rising power that threaten America newfound power and influence on the world stage.\nIn October of 1947 the General Agreement on Tariffs and Trade was signed by the United States and other countries which promoted international trade and elimination of tariffs and other trade barriers. Tariffs were largely reduced in America along with other government regulation. The reason why so many major American capitalist wanted to go global was because they would have more markets to make profit, more resources and have a cheaper work force and resources outside the US.  US influence and control in Western Europe only strengthened with the Marshall Plan which helped to rebuild Europe and the formation of military alliance known as NATO also strengthen the US influence in Europe. The Rockefeller foundation would also start to advocate for more trade relations with China in hopes of expanding their own market.  In 1979 American government in hopes of splitting the communist bloc and making cheaper goods signed a trade agreement with China which began the outsourcing of jobs and US dependence on China on certain industries such as medicine, machinery, electricity, and textiles. America would also start to rely on other countries like Saudi Arabia for other industries like oil. In 1984 under President Ronald Reagan the predecessor to NAFTA the Canada US trade agreement was signed with Canada. Furthering America free trade policy and with Reagan economics further deregulation as a whole giving corporations more and more power. \nWhen the Soviet Union fell in late 1991 allowed American influence and international capitalism to expand eastward to Russia and other former Soviet states. For a time, exploiting Russia and the others for their natural resources until 1999 with Vladimir Putin coming to power nationalizing oil industry but still Europe and America still relied heavily on Russian oil and natural gas.\nIn 1994 NAFTA was signed between America, Mexico, and Canada which caused mass outsourcing of American jobs to Mexico. The World Trade Organization came into existence which replaced the General agreement on tariff and trade. America would continue a free trade policy all the way up to Donald Trump in 2016. Who started to put tariffs on China in hopes of bring industries back to America. In 2020 many more problems in Free trade were revealed with the Covid 19 pandemic that shut down many countries causing shortages that still last to this date. Then the Russia Ukraine War started in February 2022 of this year causing more shortages especially of oil and natural gas.  Which gets us to the current crisis.\nThe Current Crisis: Karl Marx and Oswald Spengler The Predictors of Doom of Western Capitalism Through Free Trade\nThe crisis of free trade that has been building for almost 80 years and has accelerated in the last 2 years can be understand by looking into two intellectuals on issue of free trade.  The founder of communism Karl Marx and one of key figures of the German Conservative Revolution Oswald Spengler. Marx approaches the issue through a class analysis while Spengler approaches the issue from geopolitical or civilization analysis.\nMarx unlike Spengler was a supporter of free trade not because he was a capitalist but because he believed that through free trade the world would be brought closer together and class divides would widen. In one of Marx article titled “On Free Trade” Marx states this on the issue.\n“But, in general, the protective system of our day is conservative, while the free trade system is destructive. It breaks up old nationalities and pushes the antagonism of the proletariat and the bourgeoisie to the extreme point. In a word, the free trade system hastens the social revolution. It is in this revolutionary sense alone, gentlemen, that I vote in favor of free trade.”\nIf we look Mexico for example, we see that after NAFTA was signed many of small farms ended up going bankrupt due to government subsidies and tariff being cut. Along with not being able to compete with the corporations that moved into Mexico. This caused mass immigration to the United States which caused more competition in the American labor market and help to erode the traditional makeup of the United States. At the same time NAFTA created conflict inside the southern Mexico state of Chiapas. Which is home to many small indigenous farmers. An anarchist insurgent group called the Zapatista Army of National Liberation released a declaration of defiance against NAFTA which they saw as pushing them into more poverty. An Uprising would soon break out after signing of NAFTA. The conflict would last for 12 days until treaty was signed allowing Zapatista to have their own autonomous zone.\nThis was not first-time conflict t6hat had broken out over poverty, free trade and antagonism of foreign corporations’ control over the economy. In fact, as was stated earlier it was part of reason United States declared independence from Britain. There of course more modern example to like In Cuba in the 1959 which led to the rise of Communism in country. In Colombia in 1964 an insurgency broke out for many of the same reason with the conflict is still going on to this very day. Of course, it’s not just leftist who are opposing free trade and globalization. In Russia in 1990s after the fall of Soviet Union many right-wing conservatives, nationalist, and monarchist banded to together with communist in defiance against the Neo Liberal Yeltsin government that brought Russia into poverty with its Neo Liberal Shock therapy economics.  In the United States Right Wing Populism has come to the stage with Donald Trump becoming president. Trump by no means an anti-capitalist was against free trade and problems it caused like mass immigration, outsourcing, and dependence on foreign countries most notably China.  The rise of right-wing populism in America in 2015 also came with strong anti-elite sentiments with strong antagonism of prominent supports of globalism like George Soros and Hillary Clinton. While Marx was correct that with free trade would come more antagonism with the ruling capitalist. However, he was wrong to believe that it would solely be a class conflict as many of these movements even the left-wing ones embrace forms of Nationalism or localism (in case of the Zapatistas) and sought the liberation of their countries from foreign influences. Some of the left-wing ones even embraced religion and social conservatism like the Sandinista in Nicaragua which Marx would see as backwards. Not to mention many of the left-wing uprising happened in agrarian countries or regions like Chiapas, Colombia, and Nicaragua. Not in industrial countries where Marx predicted.\nMarx also did not take into account other classes that could become prominent with free trade. This class being the Drug Cartels or what I like to call the Narco Aristocrats. With the opening of borders, outsourcing of jobs and some places poverty that was created by free trade gave drug cartels a chance to also become international. With Cartels being able to get more recruits and buyers due to the depression that free trade caused in some regions like Mexico or Rural Colombia in terms of recruits or Rust Belt or Appalachia in terms of buyers. Many of these cartel’s pull billions of dollars on drug trafficking alone. The money the cartels have allows them to form armies that do fight off the Mexican and Colombian militaries. And if the current crisis within international capitalism gets worse then we can only expect the cartels to only grow and possibly take control of entire countries.\nWhile class conflict may have grown in the Americas due to free trade. In the East however with America and Europe having many of their industries and imports being based from countries like China, India, Russia, and Saudi Arabia. Western free trade has given rise to these Eastern countries to become superpowers like in the case of China and Russia and Regional power who also have major effects on the world economy nevertheless like Saudi Arabia. This of course is more in line with Oswald Spengler view of the destruction of Western capitalism than it is with Karl Marx. In Man and Technics Spengler warned that western technological capitalism was not only destroying everything that was natural but was also moving many industries to East Asian countries for profit and that this would eventually give these East Asian countries the economic power to rival the West. This is especially true for China which has the second largest economy in world partially due to Chinese state intervention and the outsourcing of western industries to China.\nThe importance of China and other eastern countries economy can be seen from the last two years alone. With China shutting down for Covid which caused masses trade distributions and shortages in America and the world. To Russia oil and natural gas being sanctioned by western countries due to the war in Ukraine which has caused a shortage of fossil fuels and the price of energy to increase. Not to mention made inflation worse for many western countries. All this was also accelerated when Saudi Arabia and OPEC announced that they would decrease oil production by 2 million barrels causing more problems for western economies.\nChina, Russia, and others have also made economic alliance like BRICS and SCO which is now competing with many western economies and economic unions. These economic unions like BRICS contributes ¼ of world GDP and 50 percent of world economic growth in the last 10 years. The eastern countries may have used western free trade to their advantage, but they always saw America and its allies as threat to their own ways of life and sovereignty. Only using the Western capitalist short sightedness for profit to their advantage. Now that China and Russia no longer needs America and the West. Russia now and sooner or later China will start to begin (or already begun in the case of Russia) military operations to claim territories that were once a part of their countries, that play geopolitical roles that could be used against China and Russia if they remain under American influence such as Ukraine and Taiwan. This of course in the case of Russia has already destroyed relations with the West and when China does move on Taiwan will do the same as well but as we seen in Russia this will probably hurt America and its allies more than it will hurt China.\nThe Return to American Protectionism\nAll the problems that free trade has caused which has hurt the American working class for decades is now finally hurting the capitalist class too. With some like Black Rock CEO Larry Fink stating that globalism has ended due to Russia Ukraine War.  However, amongst more dissident elements of capitalist like Donald Trump has already started to move America away from free trade by not only implementing tariff on China but also on European countries like the UK and France during Trumps presidency from 2017 to 2020. Even Joe Biden the current president of United States who is staunch liberal internationalist who has lifted many of these tariffs has had to sign the Chips acts which provides 280 billion dollars into funding research and manufacturing in the US of semiconductors something that is needed to make cars and computers for example.  This is not stopping the decline of the US however as America is still in economic downturn and internal conflict is becoming ever more inevitable due to partially from free trade. Not to mention America is nowhere near an autarkic or economic independences.\nWe cannot rely on the capitalist class or dark elves of this class like Moldbug call them to make America economically independent again as they will always try to expand internationally in pursuit of profit at the expense of the American people when it benefits them. Arguably many of these new protectionist policies are to desperately save Liberal globalism more than anything and these protectionist policies will be overturn if that is somehow achieve.\nHamilton protectionism had the goal of not only making America economically independent but also to be beneficial to American workers and capitalist alike. However as soon as it no longer served the capitalist interest, they abandon protectionism for free trade putting American jobs, sovereignty, and security at risk. America has resources to be economically independent and Hamilton protectionism does not need to be abandon but the more liberal elements need to be cast out of it. Important industries like fossil fuels and energy should be nationalize for national security reasons. The rest of the economy should be run by small business and coops that will be regulated by guilds where all members of a local economic sector like manufacturing for example will all be able to set prices, monitor trade, only allow local guild members to trade in a local area and would provide benefits to family if anything bad would happen to one of the members. Other concepts like family rights that base laws on how it benefits the American traditional family would be beneficial in protecting jobs and American interest. Only through the removal of the current capitalist class and being replaced by the workers can any of this be achieved.",
    "references": [
      {
        "title": "America Was Founded as a Protectionist Nation",
        "link": "https://www.huffpost.com/entry/america-was-founded-as-a_b_713521"
      },
      {
        "title": "Free Trade Fallacy",
        "link": "https://web.archive.org/web/20060106154801/http://www.newamerica.net/index.cfm?pg=article&DocID=1080"
      },
      {
        "title": "On The Question of Free Trade by Karl Marx",
        "link": "https://cooperative-individualism.org/marx-karl_on-the-question-of-free-trade-1848.htm"
      },
      {
        "title": "Man, and Technics by Oswald Spengler",
        "link": "https://avalonlibrary.net/ebooks/Oswald%20Spengler%20-%20Man%20and%20Technics.pdf"
      },
      {
        "title": "The South Carolina Nullification Controversy",
        "link": "https://www.ushistory.org/us/24c.asp#:~:text=In%201828%2C%20Congress%20passed%20a,cloth%20%E2%80%94%20mostly%20in%20the%20north"
      },
      {
        "title": "Saudis Sought Oil Production Cut So Deep It Surprised Even Russia",
        "link": "https://theintercept.com/2022/10/20/saudi-oil-production-cut/"
      },
      {
        "title": "BRICS as a Driver of Global Economic Growth and Development",
        "link": "https://journals.sagepub.com/doi/full/10.1177/09749101211067096#:~:text=The%20role%20and%20contribution%20of,(US%24%204%20trillion)"
      }
    ]
  },
  {
    "title": "A New Evil and Opportunity in Canada",
    "date": "2022/11/23",
    "author": "albino squirrel",
    "thumbnail": "/media/thumbnails/canadaeuthanasia.jpg",
    "content": "<p>I am sure everyone has heard by now about Canada horrific new euthanasia laws that will go into effect in the coming months. If you haven’t you can read about it here:<a href=\"https://www.theamericanconservative.com/the-collapse-of-consent-in-canada/\">https://www.theamericanconservative.com/the-collapse-of-consent-in-canada/</a></p><br><p>Already there has been stories of Canadian hospitals already trying to convince their patience of killing themselves or as the liberal bureaucrats in Canada like to call it “medical assistance in dying.” Many of the patience that are being ask if they want to take their own lives are the poor, the elderly, veterans suffering from PTSD and now even minors suffering from depression . All of this being justified by the liberals in Canada as being the most “humane” and less expensive way of dealing with these vulnerable  people.</p><br><p>Even if these people agree to have their own lives taken its show not only how the economic system is failing the poor and the most vulnerable in Canadian society but also how morally bankrupt the liberal system is. Not only because euthanasia is the way the Liberal Canadian systems deals with the sick instead of treating them to the end but show how little they care for the people who have served their country or the next generation that suppose to lead the country eventually. And the fact that some of these people do not want to live and the Canadian government and Medical industry is willing to help them take their own lives shows how nihilistic liberal society has become. Further showing that the liberal belief of the individual will meaning one doing whatever one wants too is completely bankrupt and is slowly destroying society.</p><br><p>While the situation may look bleak for many of my Canadian comrades but there an opportunity here. The fact that Canadian society has become so nihilistic that it gives dissidents in Canada a chance to create meaning in Canadian society and help those who are the most vulnerable in society whether it be through charity, providing housing or other means. The dissidents in Canadian society especially the socially conservative ones can show that there is more to life than ones own individual desires such as community, nation, work, and God. If dissidents can provide meaning, community, and institutions to provide for the Canadian people in their time of need then it is only a matter of time before the liberal system in Canada falls. Because the liberal system can no longer provide anything grand. As G.K Chesterton once said</p><br><p>“People talk about the impatience of the populace; but sound historians know that most tyrannies have been possible because men moved too late. It is often essential to resist a tyranny before it exists. It is no answer to say, with a distant optimism, that the scheme is only in the air. A blow from a hatchet can only be parried while it is in the air.”</p><br><p>In other words, it’s important that Canadians move quickly on this matter as soon as possible. Providing meaning and building institutions is the only way to destroy this evil.</p>",
    "references": [
      {
        "title": "The Collapse of Consent in Canada by Declan Leary",
        "link": "#"
      },
      {
        "title": "Eugenics and Other Evils by G.K Chesterton",
        "link": "#"
      }
    ]
  },
  {
    "title": "Family Rights and The State",
    "date": "2022/12/17",
    "author": "albino squirrel",
    "thumbnail": "/media/thumbnails/family.jpg",
    "content": "<p>I often hear in many circles that the concept of rights especially individual and human rights is a joke. Some criticize human rights for its universalism. Other criticize individual rights for its lack of moral responsibility to the community and society by putting the individual and his own desires above the rest of the community even when its harmful to him and others. Some also criticize liberal rights for making society revolve around the individual which cause there to be no collective sense of good. Then there are those who criticize human rights and its followers for its hypocrisy. Claiming that human rights are nothing more than a justification for the capitalist ruling class. Along with using human rights as tool to open new markets and to attack countries who do not wish to follow the liberal order. The liberals use human rights to justify invading or funding color revolutions in those countries they see as enemies while ignoring their own or their allies’ violations of human and individual rights.  For example, the American government did airstrikes and funded color revolutions in Syria and Libya. Which violates those 2 counties rights to self-determination. With many of these rebel groups that America and its allies backed being Islamic fundamentalists who could careless about individual or human rights. </p><br><p>With all this being said many not only just dismiss the liberal notions of rights but the entire concept of rights. While I agree with the sentiment of dismissing the liberal idea of rights but dismissing the whole notion of rights, I find to be a wrong move. Even some of the biggest critics of human rights like Alain De Benoist still believes we still need rights just not the liberal variety of rights. At the end of Benoist book Beyond Human Rights. Benoist advocates for the communitarian form of rights. In other words, rights based on a common view of the social good and the good life. Along with rights being around moral action, duty and virtue. While its arguable that Benoist is vague on this. however, He pushes the concepts of rights in the right direction for a society based around community and a common view of the social good. We also must remember that as Americans that rights are an important part of American society and culture. If the new system rejects the concept of rights, then its will be overthrown by the American people.</p><br><p>We must also not forget that the state is based around an idea on how to govern and rights based around the common good can be the way to bring about the ideal society.  Now that we got that out of the way we need to ask ourselves what is the common good and how to transform that into rights?</p><br><h3>What is The Common Good?</h3><br><p>The common good in its most basic definition is something that is shared by or is beneficial to most of the society. While this is vague, and many people debate on what is the common good? The common good in my opinion is the preservation of the building blocks of society like the family. For society to functions this building block must be preserved. What started society was families banding together and forming a tribe that slowly evolved into a settlement, then a city and eventually a nation state.</p><br><p>When the family decay society decays with it. One only must look at the current state of America when it comes to these things with the many broken families and a fractured communities in this country.  The family helps provide community, a sense of belonging, identity, and discipline. While the family has changed and evolved over the years, but the importance of the family has not become any less important. Now the family is more important then ever.</p><br><h3>Family Rights</h3><br><p>What are family rights? Family rights are the rights that protect the family by making it a duty of the government to protect and maintain the family by maintaining things such as the family wage, incentives to have children and creating a culture where it desirable for one to have a family. Unlike liberal individual rights which is based around the individual and more freedom to do whatever they want. Family rights are based around the family and creating the economic and cultural conditions for one to have a family.</p><br><p>The problem with modern society is that it creates the exact opposite conditions that goes against the family. By making it economically difficult to have a family due to how expensive everything is and inflation. Then on a cultural level, society encourages everyone to work which causes prices to go up. Back then though only one of the parents would have to work and the other usually the female would stay at home. Then there the fact we have a very hypersexualized culture were there almost no morals bond on what is right or wrong. Which has made divorce rates to go up, single parent households to go up, more tensions between the sexes and of course made it more difficult for the traditional family to exist. Family rights is the solution to this by making it a duty of the state to help create the conditions for the family to thrive. In this sense rights are a tool to uphold and maintain the basic building blocks of society. Now the state will not micro mange everyone, but the state will do its best to help create the right condition and help influence people to go in the right direction.</p><br><h3>Conclusion</h3><br><p>I know some people are going to rightfully say this is vague and needs a little more expansion upon this concept. Which I agree and hope to expand upon in the future. However, one of my main goals with this article is to start a conversation in the dissident sphere on how rights can be used to protect the building blocks of society like the family instead of having rights being based around individualism. I also hope see people expand upon this concept in better ways than I could or if there is already a thinker or group of thinkers who have discussed this subject then maybe we can all learn something by them and expand upon these ideas.</p><br>",
    "references": []
  },
  {
    "title": "The Lasch Pill",
    "date": "2022/12/17",
    "author": "albino squirrel",
    "thumbnail": "/media/thumbnails/christopherlasch.jpg",
    "content": "<p>In a pervious article I wrote called The Capitol Situation, I predicted that the American Right would start becoming more anti- free market capitalism and start to take more regulated takes on capitalism or hopeful eventually a more radical anti-capitalist take due to how modern capitalism pushes for open borders, outsourcing, a more hyper sexualize culture, Legalization of drugs, censoring of alterative media, lobbying the government, supporting foreign wars and radical social movements. Along with using cutthroat business tactics to out compete small businesses. In other words, things that Social Conservatives and normal people see as destructive to not only to themselves but to society.</p><br><p>Before my article came out there was already a small yet growing number of those on the American Right that were starting to take a more anti free market position such as Tucker Carlson. After January 6th many more right-wing commentators started picking it up such as Lauren Southern and John Doyle. Yet I find many on the right to still be pro capitalist who tend to blame the problems of the world on “Cultural Marxism ” when it comes to mainstream conservatives or X racial group when it comes to more radical elements of the right. I also find many of these critiques of capitalism to be mostly moderate and vague. Along with them not mentioning were they got these ideas from except for Lauren Southern who said she got it from the Red Tories.</p><br><p>I think many in the modern right especially the mainstream right would find it hard to believe that there is a anti-capitalist right wing or conservative form of socialism. Some examples of groups and Ideologies that are like this and not limited to are Distributism, Sothern Agrarians, Red Tories, Prussian Socialism, the German Conservative Revolution, Third Position, French New Right, 4th Political theory, and One Nation Conservatism. Even amongst some in the Marxist and Communist camps outside the western world tend to have very strong social conservative bents to them. Even more so than the modern conservative parties of the west. Some examples are the Communist Party of the Russian Federation, Chinese New Left, Sandinista, and the Party of Socialist of the Republic of Moldova.</p><br><p>However, while all these groups have some vailed criticism of capitalism and some interesting ideas. Many Americans tend to see them as negative or outdated. Weather it be because they are too foreign to America’s conditions, being former enemies or elitist.</p><br><p>Fortunately, though there was an American thinker who was Socially Conservative, Anti-Capitalist and Populist. His name was Christopher Lasch. Lasch was originally apart of the American New Left but by the 1970s he became disillusioned with the left due to the left moving away from the working class and social conservative positions that they originally held. He did not join the American Right seeing the combination of capitalism and conservatism as contractionary. Lasch would go on to write many books and articles such as the Culture of Narcissism, The True and only Heaven, The Revolt of the Elites and the Betrayal of Democracy and Conservatism against itself. Lasch books contained critiques of consumer, capitalism, hyper individualism, feminism, Big Business, and Big Government, along with connecting them all together.  He also advocated for the family, populism, religion, and a semi communitarian system that is based around the family, community, and moral values rather than economics or individual rights.</p><br><h3>Why Lasch?</h3><br><p>The Reason why I see Lasch as a good start to an American form of Conservative Socialism is because of his critiques that he made then are still relevant now, his synthesis politic and him being very respected amongst both many parts of the left and right. Not to mention his ideas give a more intellectual take on conservative anti capitalism. There also the fact that his ideas can be a gate away to other forms of conservative socialism that can help us form are very own form.  The last reason why I see Lasch as very important is because his populist, family and community orientation seeing how these things are very important for society to function and seeing how the modern system screws the people over along with destroying these things.</p><br><h3>The Lasch Pill</h3><br><p>Despite some respect from both the Left and Right. Lasch himself has largely been forgotten even though his book Culture of Narcissism was a best seller, and his critiques are largely still relevant to this today. It is clear however that both the modern left and right have failed to solve the modern problems of society and have made them worse. It’s time to take the Lasch Pill? what is the Lasch Pill? The Lasch Pill is being aware of the problems of consumer culture, the modern left and right, progressivism and modern conservatism, along with seeing the value of community, family and trying to advance these ideas in your own life.</p><br><p>How do we spread the Lasch Pill? There are a few ways one can do this. One is by spreading the works and ideas of Christopher Lasch. Recommend or send his books, articles or discussing his ideas with others.  Two is to live out the ideas of Lasch and setting an example to others. Three but this also goes into two is helping people in your family and community to eventually make strong connected communities. I am going to link some resources by Lasch Along with some resources on Lasch. I want everyone to help to spread these works and if one can help develop and improve these ideas further.</p><br>",
    "references": [
      {
        "title": "Conservatism Against Itself by Christopher Lasch | Articles | First Things",
        "link": "https://www.firstthings.com/article/1990/04/conservatism-against-itself"
      },
      {
        "title": "Amazon.com: Christopher Lasch: Books, Biography, Blog, Audiobooks, Kindle",
        "link": "https://www.amazon.com/Christopher-Lasch/e/B000APM2QU%3Fref=dbs_a_mng_rwt_scns_share"
      },
      {
        "title": "Christopher Lasch on Progress 1/2 – Bing video",
        "link": "https://www.bing.com/videos/search?q=christopher+lasch+interview&&view=detail&mid=F50B2C69749F4FC4882AF50B2C69749F4FC4882A&&FORM=VRDGAR&ru=%2Fvideos%2Fsearch%3Fq%3Dchristopher%2Blasch%2Binterview%26FORM%3DHDRSC4"
      },
      {
        "title": "Christopher Lasch on Progress 2/2 – Bing video",
        "link": "https://www.bing.com/videos/search?q=christopher+lasch+interview&&view=detail&mid=FA6FD5E97C8B4D124655FA6FD5E97C8B4D124655&&FORM=VRDGAR&ru=%2Fvideos%2Fsearch%3Fq%3Dchristopher%2Blasch%2Binterview%26FORM%3DHDRSC4"
      },
      {
        "title": "The Culture of Narcissism – YouTube",
        "link": "https://www.youtube.com/playlist?list=PLsLkfggTCOx8fD8J0NcrmSSwn92EXLTyB"
      },
      {
        "title": "Christopher Lasch – YouTube",
        "link": "https://www.youtube.com/playlist?list=PLsLkfggTCOx9eOMSWx8D2GyGcmT8O3VYP"
      },
      {
        "title": "Lasch Christopher The Revolt of the Elites Audiobook – YouTube",
        "link": "https://www.youtube.com/watch?v=SQ_B1VPWniI&t=2s"
      },
      {
        "title": "The Work of Christopher Lasch with Eric Miller – YouTube",
        "link": "https://www.youtube.com/watch?v=o5OXt0CIPa8"
      },
      {
        "title": "https://thesyndicalistpapers.home.blog/2021/03/06/177/",
        "link": "https://thesyndicalistpapers.home.blog/2021/03/06/177/"
      },
      {
        "title": "https://www.google.com/amp/s/www.frontporchrepublic.com/2009/08/voices-against-progress-what-i-learned-from-genovese-lasch-and-bradford/%3famp",
        "link": "https://www.google.com/amp/s/www.frontporchrepublic.com/2009/08/voices-against-progress-what-i-learned-from-genovese-lasch-and-bradford/%3famp"
      }
    ]
  },
  {
    "title": "The Economy for the Family",
    "date": "2022/12/17",
    "author": "albino squirrel",
    "thumbnail": "/media/thumbnails/americanhouse.jpg",
    "content": "<p>A little over two months ago as of writing this Roe V Wade was officially overturned by the supreme court which now gave the states the decision on what their policy will be on abortion with many states putting many restrictions on the practice. This led to mass celebrations from Social Conservatives of all types, Republicans, and Pro-Life liberals. However, this celebration is premature as there is a lot more work that needs to be done. There are still states like New York and California who have horrific abortion laws that last all the way up to 24 weeks and in New York no one will be held criminally liable if performed after 24 weeks. Then there the fact that it has become both increasingly more difficult both on a social and economic level to form strong family ties and to raise children. What conservatives next move should be is fixing these economic and social difficulties in their communities as much as possible. Dr. Lauren Johnson was correct in saying that we should address the issues on why women got abortions or held off on having a family instead of seeing Roe V Wade as the only issue.  This article will address the problem and try to work towards a long-lasting solution. This will also be an article that expands on my conception of Family Rights which was released last year around this time on the blog to give more in depth explanation and revise some issues.</p><br><h3>What Should the Family Economy and Law be?</h3><br><p>Let’s start with what the economy should not be. The economy should not be an economy that puts profit above family and community like it is today. The capitalist economy does everything it can to degrade community and family from the outsourcing of jobs to monopolization of industries at the expense of small family businesses and to constant flow of cheap labor from foreign countries at the expense of native workers if the capitalist do not automate the factory. Cutthroat prices for housing, and the encouragement from the consumer economy of today to put more value on consumer products than work and family. Along with promoting a culture of hyper individualism, and hyper sexualization at the expense of responsibilities that led to lasting relations. The Covid 19 pandemic and Russian Ukraine war made many of these issues worse especially when it comes to wealth consolidation in the hands of corporations. Even with some corporations such as Black Rock buying up the housing market.</p><br><p>All this creates a society where people are reliant on both corporate and government bureaucracies for work and other basic needs. A society where people must move around to different cities and states to keep up with work which makes it more difficult to form long lasting family and community ties. A society where things like housing are so expensive and people have to put off getting married and having kids so they can have enough money. A society where the individual career is seen as more important than everything else. In other words, it creates a society that puts profit above everything else and at the expense of everything else even when they are the basic building blocks of society.</p><br><p>There was a time when family and economy were connected and did not hinder the family. This was in the 18th, 19th century and even further back when the family farm and shop was the most prominent economic model of society. The family working would allow the family to bond and allow parents to pass down their knowledge, morals, and skills onto their children. Sometimes neighboring or on the same family farm would also have other members of family working and living on it. Making sure everyone had a place to live, and enough food on the table. The family and the local church as well played a strong role establishing moral discipline on children. This all started to change with the Industrial revolution happen which started the process of centralization of economic power in the modern era gobbling up small family farms and businesses through withholding loans and other cutthroat business tactics.</p><br><p>Now of course small family businesses still exist but are less prevalent and hold far less power than the modern corporation which is international in many cases while the small family business is local. We can also not go back to the 18th or 19th centuries, or we would be repeating the process all over again and would be throwing away the positives of industrialism like cars, better medicines, planes and much more. However, what we should strive for is the return to a national and to a local economy an economy owned by the producers not by the speculators or by multinational corporations. Where families are not at the mercy of corporations, were families and local communities have more control over the economy and not the corporations. Where people are not reliant on corporations for services but their family, neighbors, church, and local community. In Patrick Deneen book “Why Liberalism Failed” Deneen wrote on how some of this could start to be implemented now through household economics or in other words growing and making necessities and products at home instead of buying from corporations or if a family needs buy necessities buy from other households or small family businesses. This of course creates local self-efficiency and helps to foster community and strengthen it as Deneen points out. Making the interactions a lot more personal due to them being neighbors, friends, and family.</p><br><p>This is the first step of many that needs to be taken establish the family economy. When there comes a time when the liberal state is overtaken by the producers then the next phase can begin. The economy can then begin to be officially reorganized in a more national/local and family orientated way. This will be done in several ways, One the breakup of all major corporations that can be localized in production in other words small businesses and coopts will take over on local levels which will give families more control over the means of productions. Two if the corporation cannot be localized, due to product such as oil needing to be abstracted by large scale organization or is vital enough to be in the states hands then it should be nationalized. If the corporation cannot be localized, then it should be nationalized. This will allow the economy to be more nationally orientated not having these industries be outsourced or having to compete with foreigners or machines.</p><br><p>If the economic system is to be based around preserving the family, then it is clear that law in general should base around preserving the family and that laws should be measured on how they’re going to affect the family and procreation in the long term. In other words, laws that would undermine the family, parental authority, and procreation such as extremely lacks abortion and divorce laws would not be passed (not an outright banned on divorce or abortion either mind you) but laws that would help families thrive such as tax cuts for having children, free healthcare, state funded pregnancy centers and economic model that was mentioned above would be passed if it seen as beneficial in the long term for the family. This is what I call family rights. Family rights in short are rights that guarantee the family stability, and right to exist. Unlike modern liberal rights which puts the individual above everything else even at the coast of everything else, family rights put the family as one of the keys parts to having a functional society due to the family role of procreation, socialization of children and helping build local community.</p><br><p>Family rights and other ideas of collective or communitarian rights should replace individual rights as the highest form of rights because family rights understand the importance of duty and responsibility to one family, community, church, and nations while modern individual rights completely lack this understanding.  Of course, this all just some rough draft of an idea and more is needed to be expanded upon, but I hope this does lay out the idea of family rights a bit better now.</p><br>",
    "references": [
      {
        "title": "Original Article",
        "link": "https://thesyndicalistpapers.home.blog/2021/08/28/family-rights-and-the-state/"
      },
      {
        "title": "Why Liberalism Failed by Patrick Deneen",
        "link": "#"
      },
      {
        "title": "Haven in a Heartless World The Family Besieged by Christopher Lasch",
        "link": "#"
      },
      {
        "title": "Why Overturning Roe is Not a Victory – YouTube",
        "link": "https://www.youtube.com/watch?v=DFoWMLu3quo"
      }
    ]
  }
]
