[
  {
    "content": "\"Struggles within different tendencies are less dangerous than they seem at first sight. For these quarrels do not hinder the emergence of personality, they only show that it does not yet exist. A great personality does not dissolve into these issues, but overcomes them and finds a higher unity which nourishes antagonism.\"",
    "sayer": "Ernst Junger",
    "link": "https://en.wikipedia.org/wiki/Ernst_J%C3%BCnger"
  },
  {
    "content": "\"The society that separates its scholars from its warriors will have its thinking done by cowards and its fighting by fools\"",
    "sayer": "Thucydides",
    "link": "https://en.wikipedia.org/wiki/Thucydides"
  },
  {
    "content": "\"Individualism, the ideology called individualism, ‘was born in hell; and look to it, for some of you shall be the father.’ It is a denial that life has any meaning except gratification of the ego; in politics it must end in anarchy; its philosophers are Godwin, Hodgskin, and Spencer. It is not possible for one man to be both Christian and Individualist.\"",
    "sayer": "Russell Kirk",
    "link": "https://en.wikipedia.org/wiki/Russell_Kirk"
  },
  {
    "content": "\"Death with dignity is better than a life of abasement.\"",
    "sayer": "Hussein bin Ali",
    "link": "https://en.wikipedia.org/wiki/Husayn_ibn_Ali"
  },
  {
    "content": "\"Then He said to them, “But now, he who has a money bag, let him take it, and likewise a knapsack; and he who has no sword, let him sell his garment and buy one\"",
    "sayer": "Luke 22:36",
    "link": "https://www.biblegateway.com/passage/?search=Luke%2022:35-37&version=NKJV"
  },
  {
    "content": "\"Modern capitalism is just as subversive as Marxism. The materialistic view of life on which both systems are based is identical. As long as we only talk about economic classes, profit, salaries, and production, and as long as we believe that real human progress is determined by a particular system of distribution of wealth and goods, then we are not even close to what is essential.\"",
    "sayer": "Julius Evola",
    "Link": "https://en.wikipedia.org/wiki/Julius_Evola"
  },
  {
    "content": "\"Tradition, in its essence, is something simultaneously meta-historical and dynamic: it is an overall ordering force in the service of principles that have the chrism of a superior legitimacy (we may even call them 'principles from above').\"",
    "sayer": "Julius Evola",
    "Link": "https://en.wikipedia.org/wiki/Julius_Evola"
  },
  {
    "content": "\"Be radical, have principles, be absolute, be that which the bourgeoisie calls an extremist: give yourself without counting or calculating, don't accept what they call ‘the reality of life' and act in such a way that you won't be accepted by that kind of ‘life', never abandon the principle of struggle.\"",
    "sayer": "Julius Evola",
    "Link": "https://en.wikipedia.org/wiki/Julius_Evola"
  },
  {
    "content": "\"We have in fact entered upon the final phase..., the darkest period of this dark age, the state of dissolution from which there is to be no emerging except through a cataclysm, since it is no longer a mere revival which is required, but a complete renovation.\"",
    "sayer": "René Guénon",
    "Link": "https://en.wikipedia.org/wiki/Ren%C3%A9_Gu%C3%A9non"
  }
]
